; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-4-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p1-5 - location
	p2-1 - location
	p2-4 - location
	p3-1 - location
	p3-2 - location
	p4-3 - location
	p5-0 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s1)
	(at driver4 s0)
	(at driver5 s1)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at package1 s1)
	(at package2 s3)
	(at package3 s1)
	(at package4 s1)
	(at package5 s1)
	(at package6 s2)
	(at package7 s4)
	(at package8 s3)
	(at package9 s1)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 85)
	(= (time-to-walk p1-5 s1) 85)
	(= (time-to-walk s5 p1-5) 98)
	(= (time-to-walk p1-5 s5) 98)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 44)
	(= (time-to-walk p2-1 s2) 44)
	(= (time-to-walk s1 p2-1) 54)
	(= (time-to-walk p2-1 s1) 54)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 17)
	(= (time-to-walk p2-4 s2) 17)
	(= (time-to-walk s4 p2-4) 3)
	(= (time-to-walk p2-4 s4) 3)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 85)
	(= (time-to-walk p3-1 s3) 85)
	(= (time-to-walk s1 p3-1) 80)
	(= (time-to-walk p3-1 s1) 80)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 96)
	(= (time-to-walk p3-2 s3) 96)
	(= (time-to-walk s2 p3-2) 20)
	(= (time-to-walk p3-2 s2) 20)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 12)
	(= (time-to-walk p4-3 s4) 12)
	(= (time-to-walk s3 p4-3) 23)
	(= (time-to-walk p4-3 s3) 23)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 28)
	(= (time-to-walk p5-0 s5) 28)
	(= (time-to-walk s0 p5-0) 44)
	(= (time-to-walk p5-0 s0) 44)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 73)
	(= (time-to-drive s1 s0) 73)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 35)
	(= (time-to-drive s4 s0) 35)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 75)
	(= (time-to-drive s3 s1) 75)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 33)
	(= (time-to-drive s0 s2) 33)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 64)
	(= (time-to-drive s1 s2) 64)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 17)
	(= (time-to-drive s5 s2) 17)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 13)
	(= (time-to-drive s2 s3) 13)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 57)
	(= (time-to-drive s4 s3) 57)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 84)
	(= (time-to-drive s1 s4) 84)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 9)
	(= (time-to-drive s0 s5) 9)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 91)
	(= (time-to-drive s1 s5) 91)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 43)
	(= (time-to-drive s3 s5) 43)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 73)
	(= (time-to-drive s4 s5) 73)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver3 s5)
	(at truck1 s2)
	(at truck2 s0)
	(at truck3 s4)
	(at truck4 s1)
	(at package1 s3)
	(at package2 s5)
	(at package3 s1)
	(at package4 s3)
	(at package5 s3)
	(at package6 s4)
	(at package7 s5)
	(at package8 s3)
	(at package9 s5)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 3  (driven))) (* 3  (walked))))

)

; plan
1. (board-truck driver5 truck3 s1)
   deleted: (at driver5 s1) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 2 of 15
2. (load-truck package1 truck3 s1)
   deleted: (at package1 s1)
   added: (in package1 truck3)
   goals met: 2 of 15
3. (load-truck package5 truck3 s1)
   deleted: (at package5 s1)
   added: (in package5 truck3)
   goals met: 2 of 15
4. (load-truck package9 truck3 s1)
   deleted: (at package9 s1)
   added: (in package9 truck3)
   goals met: 2 of 15
5. (drive-truck truck3 s1 s4 driver5)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   changed: (driven) from 0 to 84
   goals met: 3 of 15
6. (walk driver3 s1 p1-5)
   deleted: (at driver3 s1)
   added: (at driver3 p1-5)
   changed: (walked) from 0 to 85
   goals met: 3 of 15
7. (board-truck driver4 truck1 s0)
   deleted: (at driver4 s0) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 3 of 15
8. (walk driver3 p1-5 s5)
   deleted: (at driver3 p1-5)
   added: (at driver3 s5)
   changed: (walked) from 85 to 183
   goals met: 4 of 15
9. (load-truck package7 truck3 s4)
   deleted: (at package7 s4)
   added: (in package7 truck3)
   goals met: 4 of 15
10. (drive-truck truck3 s4 s3 driver5)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   changed: (driven) from 84 to 141
   goals met: 3 of 15
11. (unload-truck package1 truck3 s3)
   deleted: (in package1 truck3)
   added: (at package1 s3)
   goals met: 4 of 15
12. (unload-truck package5 truck3 s3)
   deleted: (in package5 truck3)
   added: (at package5 s3)
   goals met: 5 of 15
13. (load-truck package2 truck3 s3)
   deleted: (at package2 s3)
   added: (in package2 truck3)
   goals met: 5 of 15
14. (drive-truck truck3 s3 s5 driver5)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   changed: (driven) from 141 to 184
   goals met: 5 of 15
15. (unload-truck package7 truck3 s5)
   deleted: (in package7 truck3)
   added: (at package7 s5)
   goals met: 6 of 15
16. (unload-truck package9 truck3 s5)
   deleted: (in package9 truck3)
   added: (at package9 s5)
   goals met: 7 of 15
17. (unload-truck package2 truck3 s5)
   deleted: (in package2 truck3)
   added: (at package2 s5)
   goals met: 8 of 15
18. (drive-truck truck3 s5 s4 driver5)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (driven) from 184 to 257
   goals met: 9 of 15
19. (disembark-truck driver5 truck3 s4)
   deleted: (driving driver5 truck3)
   added: (at driver5 s4) (empty truck3)
   goals met: 9 of 15
20. (board-truck driver5 truck2 s4)
   deleted: (at driver5 s4) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 9 of 15
21. (drive-truck truck2 s4 s0 driver5)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   changed: (driven) from 257 to 292
   goals met: 10 of 15
22. (disembark-truck driver5 truck2 s0)
   deleted: (driving driver5 truck2)
   added: (at driver5 s0) (empty truck2)
   goals met: 10 of 15
23. (board-truck driver5 truck4 s0)
   deleted: (at driver5 s0) (empty truck4)
   added: (driving driver5 truck4)
   goals met: 10 of 15
24. (drive-truck truck4 s0 s1 driver5)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (driven) from 292 to 365
   goals met: 11 of 15
25. (load-truck package4 truck4 s1)
   deleted: (at package4 s1)
   added: (in package4 truck4)
   goals met: 11 of 15
26. (drive-truck truck1 s0 s2 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 365 to 398
   goals met: 12 of 15
27. (load-truck package6 truck1 s2)
   deleted: (at package6 s2)
   added: (in package6 truck1)
   goals met: 12 of 15
28. (drive-truck truck4 s1 s3 driver5)
   deleted: (at truck4 s1)
   added: (at truck4 s3)
   changed: (driven) from 398 to 473
   goals met: 11 of 15
29. (unload-truck package4 truck4 s3)
   deleted: (in package4 truck4)
   added: (at package4 s3)
   goals met: 12 of 15
30. (drive-truck truck4 s3 s1 driver5)
   deleted: (at truck4 s3)
   added: (at truck4 s1)
   changed: (driven) from 473 to 548
   goals met: 13 of 15
31. (drive-truck truck1 s2 s0 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (driven) from 548 to 581
   goals met: 12 of 15
32. (drive-truck truck1 s0 s4 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (driven) from 581 to 616
   goals met: 12 of 15
33. (unload-truck package6 truck1 s4)
   deleted: (in package6 truck1)
   added: (at package6 s4)
   goals met: 13 of 15
34. (disembark-truck driver5 truck4 s1)
   deleted: (driving driver5 truck4)
   added: (at driver5 s1) (empty truck4)
   goals met: 13 of 15
35. (walk driver1 s2 p2-1)
   deleted: (at driver1 s2)
   added: (at driver1 p2-1)
   changed: (walked) from 183 to 227
   goals met: 13 of 15
36. (drive-truck truck1 s4 s1 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (driven) from 616 to 700
   goals met: 13 of 15
37. (walk driver1 p2-1 s1)
   deleted: (at driver1 p2-1)
   added: (at driver1 s1)
   changed: (walked) from 227 to 281
   goals met: 13 of 15
38. (disembark-truck driver4 truck1 s1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s1) (empty truck1)
   goals met: 13 of 15
39. (board-truck driver5 truck1 s1)
   deleted: (at driver5 s1) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 13 of 15
40. (drive-truck truck1 s1 s2 driver5)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (driven) from 700 to 764
   goals met: 14 of 15
41. (board-truck driver4 truck4 s1)
   deleted: (at driver4 s1) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 14 of 15
42. (drive-truck truck4 s1 s0 driver4)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (driven) from 764 to 837
   goals met: 13 of 15
43. (disembark-truck driver5 truck1 s2)
   deleted: (driving driver5 truck1)
   added: (at driver5 s2) (empty truck1)
   goals met: 13 of 15
44. (disembark-truck driver4 truck4 s0)
   deleted: (driving driver4 truck4)
   added: (at driver4 s0) (empty truck4)
   goals met: 13 of 15
45. (walk driver1 s1 p1-5)
   deleted: (at driver1 s1)
   added: (at driver1 p1-5)
   changed: (walked) from 281 to 366
   goals met: 13 of 15
46. (walk driver1 p1-5 s5)
   deleted: (at driver1 p1-5)
   added: (at driver1 s5)
   changed: (walked) from 366 to 464
   goals met: 13 of 15
47. (walk driver1 s5 p5-0)
   deleted: (at driver1 s5)
   added: (at driver1 p5-0)
   changed: (walked) from 464 to 492
   goals met: 13 of 15
48. (board-truck driver4 truck4 s0)
   deleted: (at driver4 s0) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 13 of 15
49. (walk driver1 p5-0 s0)
   deleted: (at driver1 p5-0)
   added: (at driver1 s0)
   changed: (walked) from 492 to 536
   goals met: 14 of 15
50. (drive-truck truck4 s0 s1 driver4)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (driven) from 837 to 910
   goals met: 15 of 15
